test/tests/multiapps/temperature_set_on_openfoam_boundary/serial/buoyantCavity/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.12;

boundaryField
{
    patch0
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    patch1
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    patch2
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    patch3
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    patch4
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
    patch5
    {
        beta1           0.075;
        blended         0;
        type            omegaWallFunction;
        value           uniform 0.12;
    }
}


// ************************************************************************* //
